IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_INTAGGR_0_INTAGGR_INTR.xml
<module name="DMASS0_INTAGGR_0_INTAGGR_INTR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="INTAGGR_INTR_ENABLE_SET" acronym="INTAGGR_INTR_ENABLE_SET" offset="0x0" width="64" description="The Interrupt Enable Set register is written by software to enable (i.e. unmask) specified bits to allow their current status to be considered in the generation of the corresponding level sensitive virtual interrupt output.">
		<bitfield id="INTR_ENABLE" width="64" begin="63" end="0" resetval="0x0" description="Interrupt enable set value.  On writes, set bits will cause corresponding bits in the internal interrupt enable register to be set.  Reads will reflect back the current status of the internal interrupt enable register." range="63 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="INTAGGR_INTR_ENABLE_CLR" acronym="INTAGGR_INTR_ENABLE_CLR" offset="0x8" width="64" description="The Interrupt Enable Clear register is written by software to disable (i.e. mask) specified bits to disallow their current status from be considered in the generation of the corresponding level sensitive virtual interrupt output.">
		<bitfield id="INTR_ENABLE" width="64" begin="63" end="0" resetval="0x0" description="Interrupt enable clear value.  On writes, set bits will cause corresponding bits in the internal interrupt enable register to be cleared.  Reads will reflect back the current status of the internal interrupt enable register." range="63 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="INTAGGR_INTR_STATUS_SET" acronym="INTAGGR_INTR_STATUS_SET" offset="0x10" width="64" description="The Interrupt Status register is read by software to determine the cause of an interrupt.">
		<bitfield id="INTR_STATUS" width="64" begin="63" end="0" resetval="0x0" description="Raw state (not enabled/masked) of bits in internal interrupt status register.  Writing a 1 to any bit of this register will cause the corresponding raw status bit to be set" range="63 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="INTAGGR_INTR_STATUS" acronym="INTAGGR_INTR_STATUS" offset="0x18" width="64" description="The Interrupt Status register is read by software to determine the cause of an interrupt.">
		<bitfield id="INTR_STATUS" width="64" begin="63" end="0" resetval="0x0" description="Raw state (not enabled/masked) of bits in internal interrupt status register.  Writing a 1 to any bit of this register will cause the corresponding raw status bit to be cleared" range="63 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="INTAGGR_INTR_STATUS_MSKD" acronym="INTAGGR_INTR_STATUS_MSKD" offset="0x20" width="64" description="The Interrupt Masked Status register can be read by software to determine the cause of an interrupt.">
		<bitfield id="INTR_STATUSM" width="64" begin="63" end="0" resetval="0x0" description="Masked state of bits in internal interrupt status register.  This value is the result of bitwise ANDing the interrupt enable and status registers" range="63 - 0" rwaccess="R/NA"/>
	</register>
</module>